app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes`

  def create
    @prototype = Prototype.new(prototypes_params)
    if @prototype.save
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('東京夕焼け', '東京夕焼け', '東京夕焼け', 1, '2025-03-14 04:33:00.496493', '2025-03-14 04:33:00.496493')

  def edit
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1

  def update
    @prototype = Prototype.find(params[:id])

    if @prototype.update(prototypes_params)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`title` = '東京夕焼け写真', `prototypes`.`updated_at` = '2025-03-13 05:27:31.685627' WHERE `prototypes`.`id` = 1

  def destroy
    prototype = Prototype.find(params[:id])
    prototype.destroy
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 1

  def set_prototype
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1